import * as yup from 'yup';

export const registrationSchema = yup.object().shape({
  firstName: yup
    .string()
    .required('სახელი სავალდებულოა')
    .min(4, 'სახელი უნდა იყოს მინიმუმ 4 სიმბოლო')
    .max(20, 'სახელი უნდა იყოს მაქსიმუმ 20 სიმბოლო'),
  
  lastName: yup
    .string()
    .required('გვარი სავალდებულოა')
    .min(4, 'გვარი უნდა იყოს მინიმუმ 4 სიმბოლო')
    .max(20, 'გვარი უნდა იყოს მაქსიმუმ 20 სიმბოლო'),
  
  age: yup
    .number()
    .required('ასაკი სავალდებულოა')
    .typeError('ასაკი უნდა იყოს რიცხვი')
    .min(13, 'ასაკი უნდა იყოს მინიმუმ 13')
    .max(120, 'ასაკი უნდა იყოს მაქსიმუმ 120'),
  
  email: yup
    .string()
    .required('იმეილი სავალდებულოა')
    .email('არასწორი იმეილის ფორმატი'),
  
  password: yup
    .string()
    .required('პაროლი სავალდებულოა')
    .min(6, 'პაროლი უნდა იყოს მინიმუმ 6 სიმბოლო')
    .max(12, 'პაროლი უნდა იყოს მაქსიმუმ 12 სიმბოლო')
    .matches(/[A-Z]/, 'პაროლი უნდა შეიცავდეს მინიმუმ 1 დიდ ასოს')
    .matches(/[a-z]/, 'პაროლი უნდა შეიცავდეს მინიმუმ 1 პატარა ასოს')
    .matches(/[0-9]/, 'პაროლი უნდა შეიცავდეს მინიმუმ 1 რიცხვს'),
  
  phone: yup
    .string()
    .required('ტელეფონი სავალდებულოა')
    .matches(/^[0-9]+$/, 'ტელეფონი უნდა შეიცავდეს მხოლოდ ციფრებს')
    .min(10, 'ტელეფონი უნდა იყოს მინიმუმ 10 სიმბოლო')
    .max(100, 'ტელეფონი უნდა იყოს მაქსიმუმ 100 სიმბოლო'),
});

export const loginSchema = yup.object().shape({
  username: yup
    .string()
    .required('სახელი აუცილებელია')
    .min(3, 'სახელი უნდა იყოს მინიმუმ 3 სიმბოლო'),
  password: yup
    .string()
    .required('პაროლი აუცილებელია')
    .min(4, 'პაროლი უნდა იყოს მინიმუმ 4 სიმბოლო'),
  rememberMe: yup.boolean(),
});